In [1]:
import pandas as pd

In [2]:
dt=pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\inputData.xlsx")
dt

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [3]:
dt1=dt.copy()

In [4]:
dt1

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [5]:
dt1['Total']=dt1['English']+dt1['Physics']+dt1['Chemistry']+dt1['Mathematics']

In [6]:
dt1

   First Name Last Name  English  Physics  Chemistry  Mathematics  Total
0       Aarav     Patil       85       78         90           92    345
1      Vihaan  Deshmukh       88       81         85           89    343
2       Ayaan    Jadhav       90       75         88           84    337
3       Arjun      More       76       89         91           78    334
4     Reyansh     Joshi       82       80         84           85    331
..        ...       ...      ...      ...        ...          ...    ...
60      Tarun    Dhumal       82       87         81           85    335
61      Arnav   Khedkar       85       90         78           89    342
62      Payal     Patil       89       76         87           91    343
63      Rahul     Kadam       81       83         84           90    338
64        Jay    Bhagat       90       77         65           88    320

[65 rows x 7 columns]

In [7]:
dt1['Full Name']=dt1['First Name']+" "+dt1['Last Name']
dt1

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
0,Aarav,Patil,85,78,90,92,345,Aarav Patil
1,Vihaan,Deshmukh,88,81,85,89,343,Vihaan Deshmukh
2,Ayaan,Jadhav,90,75,88,84,337,Ayaan Jadhav
3,Arjun,More,76,89,91,78,334,Arjun More
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
...,...,...,...,...,...,...,...,...
60,Tarun,Dhumal,82,87,81,85,335,Tarun Dhumal
61,Arnav,Khedkar,85,90,78,89,342,Arnav Khedkar
62,Payal,Patil,89,76,87,91,343,Payal Patil
63,Rahul,Kadam,81,83,84,90,338,Rahul Kadam
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

In [8]:
dt

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [9]:
# Sorts the DataFrame by the specified column(s):
# Syntax:
# sort_values(by, ascending=True/False, inplace=True/False): 
#                     True                False              ==> default 

# inplace : True==> Change in original dataframe
#          False==> Changes not visible in original dataframe

In [10]:
dt1.sort_values(by='Last Name')

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat
41,Jaya,Bhagat,92,88,76,89,345,Jaya Bhagat
56,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
8,Krish,Bhosale,80,85,83,89,337,Krish Bhosale
...,...,...,...,...,...,...,...,...
9,Samarth,Shinde,89,79,87,88,343,Samarth Shinde
17,Rohan,Suryavanshi,78,82,90,86,336,Rohan Suryavanshi
7,Rohan,Suryavanshi,78,82,90,86,336,Rohan Suryavanshi
24,Tejas,Waghmare,85,82,90,85,342,Tejas Waghmare
47,Tejas,Waghmare,85,82,90,85,342,Tejas Waghmare

In [20]:
dt2=dt1.sort_values(by='Total',ascending=False)
dt2

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
58,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
35,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
6,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
16,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
...,...,...,...,...,...,...,...,...
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
14,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
27,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
50,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

In [21]:
dt1

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
58,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
35,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
6,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
16,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
...,...,...,...,...,...,...,...,...
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
14,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
27,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
50,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

In [13]:
# inplace : True==> Change in original dataframe
# False==> Changes not visible in original dataframe

In [22]:
dt3=dt1.sort_values(by='Full Name',ascending=False,inplace=False)
dt3

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
5,Vivaan,Nair,87,83,79,90,339,Vivaan Nair
15,Vivaan,Nair,87,83,79,90,339,Vivaan Nair
1,Vihaan,Deshmukh,88,81,85,89,343,Vihaan Deshmukh
11,Vihaan,Deshmukh,88,81,85,89,343,Vihaan Deshmukh
24,Tejas,Waghmare,85,82,90,85,342,Tejas Waghmare
...,...,...,...,...,...,...,...,...
30,Aditi,Rajput,90,88,82,87,347,Aditi Rajput
56,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
0,Aarav,Patil,85,78,90,92,345,Aarav Patil
10,Aarav,Patil,85,78,90,92,345,Aarav Patil

In [23]:
dt1

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
58,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
35,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
6,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
16,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
...,...,...,...,...,...,...,...,...
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
14,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
27,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
50,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

In [24]:
dt1.columns

Index(['First Name', 'Last Name', 'English', 'Physics', 'Chemistry',
       'Mathematics', 'Total', 'Full Name'],
      dtype='object')

In [26]:
dt1.sort_values(by=['First Name','Total'],ascending=[True,False])
dt1

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
58,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
35,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
6,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
16,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
...,...,...,...,...,...,...,...,...
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
14,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
27,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
50,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

#### Duplicate

In [27]:
dt1.shape

(65, 8)

In [28]:
dt1[dt1.duplicated()]

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
35,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
16,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
56,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
53,Aditi,Rajput,90,88,82,87,347,Aditi Rajput
10,Aarav,Patil,85,78,90,92,345,Aarav Patil
44,Anaya,Gawande,84,90,82,88,344,Anaya Gawande
9,Samarth,Shinde,89,79,87,88,343,Samarth Shinde
1,Vihaan,Deshmukh,88,81,85,89,343,Vihaan Deshmukh
39,Payal,Patil,89,76,87,91,343,Payal Patil
59,Pooja,Mhatre,84,79,88,92,343,Pooja Mhatre
38,Arnav,Khedkar,85,90,78,89,342,Arnav Khedkar
23,Kaira,Nikam,88,80,84,90,342,Kaira Nikam
24,Tejas,Waghmare,85,82,90,85,342,Tejas Waghmare
29,Shreya,Dandekar,89,75,88,90,342,Shreya Dandekar
54,Radhika,Ghorpade,83,79,91,88,341,Radhika Ghorpade
43,Riya,Kulkarni,91,84,78,87,340,Riya Kulkarni
55,Nikhil,Patankar,87,80,89,84,340,Nikhil Patankar
15,Vivaan,Nair,87,83,79,90,339,Vivaan Nair
63,Rahul,Kadam,81,83,84,90,338,Rahul Kadam
28,Disha,Chavan,86,83,80,89,338,Disha Chavan
12,Ayaan,Jadhav,90,75,88,84,337,Ayaan Jadhav
8,Krish,Bhosale,80,85,83,89,337,Krish Bhosale
48,Rishabh,Ghadge,92,78,86,81,337,Rishabh Ghadge
57,Raghav,Khedekar,79,86,82,90,337,Raghav Khedekar
22,Isha,Kamble,79,76,89,92,336,Isha Kamble
17,Rohan,Suryavanshi,78,82,90,86,336,Rohan Suryavanshi
37,Tarun,Dhumal,82,87,81,85,335,Tarun Dhumal
49,Kunal,Kshirsagar,81,81,85,88,335,Kunal Kshirsagar
3,Arjun,More,76,89,91,78,334,Arjun More
14,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
50,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale

In [29]:
dt1.drop_duplicates(inplace=True)

In [30]:
dt1

,First Name,Last Name,English,Physics,Chemistry,Mathematics,Total,Full Name
58,Sneha,Gokhale,88,84,90,86,348,Sneha Gokhale
33,Aarvi,Bhandari,90,81,85,91,347,Aarvi Bhandari
6,Aditya,Pawar,92,88,76,91,347,Aditya Pawar
30,Aditi,Rajput,90,88,82,87,347,Aditi Rajput
0,Aarav,Patil,85,78,90,92,345,Aarav Patil
41,Jaya,Bhagat,92,88,76,89,345,Jaya Bhagat
21,Anaya,Gawande,84,90,82,88,344,Anaya Gawande
19,Samarth,Shinde,89,79,87,88,343,Samarth Shinde
11,Vihaan,Deshmukh,88,81,85,89,343,Vihaan Deshmukh
36,Pooja,Mhatre,84,79,88,92,343,Pooja Mhatre
62,Payal,Patil,89,76,87,91,343,Payal Patil
61,Arnav,Khedkar,85,90,78,89,342,Arnav Khedkar
52,Shreya,Dandekar,89,75,88,90,342,Shreya Dandekar
46,Kaira,Nikam,88,80,84,90,342,Kaira Nikam
47,Tejas,Waghmare,85,82,90,85,342,Tejas Waghmare
31,Radhika,Ghorpade,83,79,91,88,341,Radhika Ghorpade
32,Nikhil,Patankar,87,80,89,84,340,Nikhil Patankar
20,Riya,Kulkarni,91,84,78,87,340,Riya Kulkarni
5,Vivaan,Nair,87,83,79,90,339,Vivaan Nair
42,Misha,Choudhary,78,85,90,86,339,Misha Choudhary
40,Rahul,Kadam,81,83,84,90,338,Rahul Kadam
51,Disha,Chavan,86,83,80,89,338,Disha Chavan
2,Ayaan,Jadhav,90,75,88,84,337,Ayaan Jadhav
34,Raghav,Khedekar,79,86,82,90,337,Raghav Khedekar
25,Rishabh,Ghadge,92,78,86,81,337,Rishabh Ghadge
18,Krish,Bhosale,80,85,83,89,337,Krish Bhosale
7,Rohan,Suryavanshi,78,82,90,86,336,Rohan Suryavanshi
45,Isha,Kamble,79,76,89,92,336,Isha Kamble
26,Kunal,Kshirsagar,81,81,85,88,335,Kunal Kshirsagar
60,Tarun,Dhumal,82,87,81,85,335,Tarun Dhumal
13,Arjun,More,76,89,91,78,334,Arjun More
4,Reyansh,Joshi,82,80,84,85,331,Reyansh Joshi
27,Tanvi,Ingale,78,77,83,92,330,Tanvi Ingale
64,Jay,Bhagat,90,77,65,88,320,Jay Bhagat

In [31]:
dt1.shape

(34, 8)

In [32]:
dt[dt['First Name']=='Rahul']

   First Name Last Name  English  Physics  Chemistry  Mathematics
40      Rahul     Kadam       81       83         84           90
63      Rahul     Kadam       81       83         84           90